# language: ru

Функция: Переход на страницу "Редактирование страницы акции"
  Как организатору акции
  Мне нужно перейти на страницу "Редактирование страницы акции"
  Чтобы редактировать данные

  Сценарий: Успешный переход на страницу "Редактирование страницы акции"
    Если я нахожусь на странице "Предпросмотр страницы акции"
    И я нажимаю кнопку "Редактировать"
    То Субботник должен открыть страницу "Редактирование страницы акции"
    И Субботник должен отобразить все заполненные мною поля с данными
    И Субботник должен отобразить поле для добавления фотографии


