# language: ru

Функция: Просмотр опубликованной страницы акции
  Как организатору акции
  Мне нужно увидеть опубликованную страницу акции
  Чтобы убедиться, что страница акции опубликована в Субботнике.

  Сценарий:
    Допустим я на странице "Публикация страницы акции"
    Если я нажимаю на ссылку "Перейти на страницу акции"
    То Субботник открывает последнюю созданную мной страницу акции.

Функция: Переход к странице "Поделиться акцией"
  Как организатору акции
  Мне нужно перейти к странице "Поделиться акцией"
  Чтобы поделиться акцией.

  Сценарий:
    Допустим я на странице "Публикация страницы акции"
    Если я нажимаю на ссылку "Поделиться акцией"
    То Субботник открывает страницу "Расшаривание страницы акции".

Функция: Возврат на "Главную страницу" Субботника
  Как организатору акции
  Мне нужно вернуться на "Главную страницу" Субботника
  Чтобы создать новую акцию,получить информацию о других акциях или перейти в архив акций.

  Допустим я на странице "Публикация страницы акции"
  Если я нажимаю на ссылку "Вернуться на Главную страницу"
  То Субботник открывает страницу "Главная страница".
